MarshalingTests.cpp
InheritanceTests.cpp
FieldTests.cpp
ManglingTests.cpp
TemplateTests.cpp
class ?$AdderTemplate@F	size(2):
	+---
 0	| num
	+---



class ?$AdderTemplate@H	size(4):
	+---
 0	| num
	+---



class ?$AdderTemplate@M	size(4):
	+---
 0	| num
	+---



class ?$AdderTemplate@N	size(8):
	+---
 0	| num
	+---



ArrayTests.cpp
Generating Code...
