MarshalingTests.cpp
class _s__RTTIBaseClassDescriptor2	size(28):
	+---
 0	| pTypeDescriptor
 4	| numContainedBases
 8	| _PMD where
20	| attributes
24	| pClassDescriptor
	+---



class _s__RTTIBaseClassArray	size(1):
	+---
 0	| arrayOfBaseClassDescriptors
	+---



class _s__RTTIClassHierarchyDescriptor	size(16):
	+---
 0	| signature
 4	| attributes
 8	| numBaseClasses
12	| pBaseClassArray
	+---



class ClassWithCopyCtor	size(4):
	+---
 0	| x
	+---



class ClassWithDtor	size(4):
	+---
 0	| x
	+---



class ClassWithoutCopyCtor	size(4):
	+---
 0	| x
	+---



class Class	size(4):
	+---
 0	| x
	+---



InheritanceTests.cpp
class _s__RTTIBaseClassDescriptor2	size(28):
	+---
 0	| pTypeDescriptor
 4	| numContainedBases
 8	| _PMD where
20	| attributes
24	| pClassDescriptor
	+---



class _s__RTTIBaseClassArray	size(1):
	+---
 0	| arrayOfBaseClassDescriptors
	+---



class _s__RTTIClassHierarchyDescriptor	size(16):
	+---
 0	| signature
 4	| attributes
 8	| numBaseClasses
12	| pBaseClassArray
	+---



class NumberClass	size(8):
	+---
 0	| {vfptr}
 4	| num
	+---

NumberClass::$vftable@:
	| &NumberClass_meta
	|  0
 0	| &NumberClass::NegativeNumber
 1	| &NumberClass::Number
 2	| &NumberClass::{dtor}

NumberClass::NegativeNumber this adjustor: 0
NumberClass::Number this adjustor: 0
NumberClass::{dtor} this adjustor: 0
NumberClass::__delDtor this adjustor: 0
NumberClass::__vecDelDtor this adjustor: 0


class AdderClass	size(8):
	+---
	| +--- (base class NumberClass)
 0	| | {vfptr}
 4	| | num
	| +---
	+---

AdderClass::$vftable@:
	| &AdderClass_meta
	|  0
 0	| &NumberClass::NegativeNumber
 1	| &NumberClass::Number
 2	| &AdderClass::{dtor}
 3	| &AdderClass::Add

AdderClass::Add this adjustor: 0
AdderClass::{dtor} this adjustor: 0
AdderClass::__delDtor this adjustor: 0
AdderClass::__vecDelDtor this adjustor: 0


class AdderClassWithVirtualBase	size(16):
	+---
 0	| {vfptr}
 4	| {vbptr}
	+---
	+--- (virtual base NumberClass)
 8	| {vfptr}
12	| num
	+---

AdderClassWithVirtualBase::$vftable@AdderClassWithVirtualBase@:
	| &AdderClassWithVirtualBase_meta
	|  0
 0	| &AdderClassWithVirtualBase::Add

AdderClassWithVirtualBase::$vbtable@:
 0	| -4
 1	| 4 (AdderClassWithVirtualBased(AdderClassWithVirtualBase+4)NumberClass)

AdderClassWithVirtualBase::$vftable@NumberClass@:
	| -8
 0	| &NumberClass::NegativeNumber
 1	| &NumberClass::Number
 2	| &AdderClassWithVirtualBase::{dtor}

AdderClassWithVirtualBase::Add this adjustor: 0
AdderClassWithVirtualBase::{dtor} this adjustor: 8
AdderClassWithVirtualBase::__delDtor this adjustor: 8
AdderClassWithVirtualBase::__vecDelDtor this adjustor: 8

vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
     NumberClass       8       4       4 0


class MultiplierClass	size(8):
	+---
	| +--- (base class NumberClass)
 0	| | {vfptr}
 4	| | num
	| +---
	+---

MultiplierClass::$vftable@:
	| &MultiplierClass_meta
	|  0
 0	| &NumberClass::NegativeNumber
 1	| &NumberClass::Number
 2	| &MultiplierClass::{dtor}
 3	| &MultiplierClass::Multiply

MultiplierClass::Multiply this adjustor: 0
MultiplierClass::{dtor} this adjustor: 0
MultiplierClass::__delDtor this adjustor: 0
MultiplierClass::__vecDelDtor this adjustor: 0


class MultiplierClassWithVirtualBase	size(16):
	+---
 0	| {vfptr}
 4	| {vbptr}
	+---
	+--- (virtual base NumberClass)
 8	| {vfptr}
12	| num
	+---

MultiplierClassWithVirtualBase::$vftable@MultiplierClassWithVirtualBase@:
	| &MultiplierClassWithVirtualBase_meta
	|  0
 0	| &MultiplierClassWithVirtualBase::Multiply

MultiplierClassWithVirtualBase::$vbtable@:
 0	| -4
 1	| 4 (MultiplierClassWithVirtualBased(MultiplierClassWithVirtualBase+4)NumberClass)

MultiplierClassWithVirtualBase::$vftable@NumberClass@:
	| -8
 0	| &NumberClass::NegativeNumber
 1	| &NumberClass::Number
 2	| &MultiplierClassWithVirtualBase::{dtor}

MultiplierClassWithVirtualBase::Multiply this adjustor: 0
MultiplierClassWithVirtualBase::{dtor} this adjustor: 8
MultiplierClassWithVirtualBase::__delDtor this adjustor: 8
MultiplierClassWithVirtualBase::__vecDelDtor this adjustor: 8

vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
     NumberClass       8       4       4 0


class ClassWithNonVirtualBases	size(16):
	+---
	| +--- (base class AdderClass)
	| | +--- (base class NumberClass)
 0	| | | {vfptr}
 4	| | | num
	| | +---
	| +---
	| +--- (base class MultiplierClass)
	| | +--- (base class NumberClass)
 8	| | | {vfptr}
12	| | | num
	| | +---
	| +---
	+---

ClassWithNonVirtualBases::$vftable@AdderClass@:
	| &ClassWithNonVirtualBases_meta
	|  0
 0	| &NumberClass::NegativeNumber
 1	| &NumberClass::Number
 2	| &ClassWithNonVirtualBases::{dtor}
 3	| &AdderClass::Add
 4	| &ClassWithNonVirtualBases::CallMultiply

ClassWithNonVirtualBases::$vftable@MultiplierClass@:
	| -8
 0	| &NumberClass::NegativeNumber
 1	| &NumberClass::Number
 2	| &thunk: this-=8; goto ClassWithNonVirtualBases::{dtor}
 3	| &MultiplierClass::Multiply

ClassWithNonVirtualBases::CallMultiply this adjustor: 0
ClassWithNonVirtualBases::{dtor} this adjustor: 0
ClassWithNonVirtualBases::__delDtor this adjustor: 0
ClassWithNonVirtualBases::__vecDelDtor this adjustor: 0


class ClassWithVirtualBases	size(24):
	+---
	| +--- (base class AdderClassWithVirtualBase)
 0	| | {vfptr}
 4	| | {vbptr}
	| +---
	| +--- (base class MultiplierClassWithVirtualBase)
 8	| | {vfptr}
12	| | {vbptr}
	| +---
	+---
	+--- (virtual base NumberClass)
16	| {vfptr}
20	| num
	+---

ClassWithVirtualBases::$vftable@AdderClassWithVirtualBase@:
	| &ClassWithVirtualBases_meta
	|  0
 0	| &AdderClassWithVirtualBase::Add

ClassWithVirtualBases::$vftable@MultiplierClassWithVirtualBase@:
	| -8
 0	| &MultiplierClassWithVirtualBase::Multiply

ClassWithVirtualBases::$vbtable@AdderClassWithVirtualBase@:
 0	| -4
 1	| 12 (ClassWithVirtualBasesd(AdderClassWithVirtualBase+4)NumberClass)

ClassWithVirtualBases::$vbtable@MultiplierClassWithVirtualBase@:
 0	| -4
 1	| 4 (ClassWithVirtualBasesd(MultiplierClassWithVirtualBase+4)NumberClass)

ClassWithVirtualBases::$vftable@NumberClass@:
	| -16
 0	| &NumberClass::NegativeNumber
 1	| &NumberClass::Number
 2	| &ClassWithVirtualBases::{dtor}

ClassWithVirtualBases::{dtor} this adjustor: 16
ClassWithVirtualBases::__delDtor this adjustor: 16
ClassWithVirtualBases::__vecDelDtor this adjustor: 16

vbi:	   class  offset o.vbptr  o.vbte fVtorDisp
     NumberClass      16       4       4 0


class ClassThatOverridesStuff	size(12):
	+---
	| +--- (base class NumberClass)
 0	| | {vfptr}
 4	| | num
	| +---
 8	| myNum
	+---

ClassThatOverridesStuff::$vftable@:
	| &ClassThatOverridesStuff_meta
	|  0
 0	| &NumberClass::NegativeNumber
 1	| &ClassThatOverridesStuff::Number
 2	| &ClassThatOverridesStuff::{dtor}
 3	| &ClassThatOverridesStuff::BaseNumber

ClassThatOverridesStuff::Number this adjustor: 0
ClassThatOverridesStuff::{dtor} this adjustor: 0
ClassThatOverridesStuff::BaseNumber this adjustor: 0
ClassThatOverridesStuff::__delDtor this adjustor: 0
ClassThatOverridesStuff::__vecDelDtor this adjustor: 0


class ClassThatRoundtrips	size(12):
	+---
	| +--- (base class MultiplierClass)
	| | +--- (base class NumberClass)
 0	| | | {vfptr}
 4	| | | num
	| | +---
	| +---
 8	| that
	+---

ClassThatRoundtrips::$vftable@:
	| &ClassThatRoundtrips_meta
	|  0
 0	| &NumberClass::NegativeNumber
 1	| &NumberClass::Number
 2	| &ClassThatRoundtrips::{dtor}
 3	| &MultiplierClass::Multiply
 4	| &ClassThatRoundtrips::GetThat
 5	| &ClassThatRoundtrips::GetThis

ClassThatRoundtrips::GetThat this adjustor: 0
ClassThatRoundtrips::GetThis this adjustor: 0
ClassThatRoundtrips::{dtor} this adjustor: 0
ClassThatRoundtrips::__delDtor this adjustor: 0
ClassThatRoundtrips::__vecDelDtor this adjustor: 0


FieldTests.cpp
class _s__RTTIBaseClassDescriptor2	size(28):
	+---
 0	| pTypeDescriptor
 4	| numContainedBases
 8	| _PMD where
20	| attributes
24	| pClassDescriptor
	+---



class _s__RTTIBaseClassArray	size(1):
	+---
 0	| arrayOfBaseClassDescriptors
	+---



class _s__RTTIClassHierarchyDescriptor	size(16):
	+---
 0	| signature
 4	| attributes
 8	| numBaseClasses
12	| pBaseClassArray
	+---



ManglingTests.cpp
class _s__RTTIBaseClassDescriptor2	size(28):
	+---
 0	| pTypeDescriptor
 4	| numContainedBases
 8	| _PMD where
20	| attributes
24	| pClassDescriptor
	+---



class _s__RTTIBaseClassArray	size(1):
	+---
 0	| arrayOfBaseClassDescriptors
	+---



class _s__RTTIClassHierarchyDescriptor	size(16):
	+---
 0	| signature
 4	| attributes
 8	| numBaseClasses
12	| pBaseClassArray
	+---



Generating Code...
   Creating library ..\bin\Debug\libtest.lib and object ..\bin\Debug\libtest.exp
